MikroElektronika/core_packages/PIC/XC8/def/PIC18F25K42/mcu.h
// Register: PIR5
#define PIR5 PIR5
extern volatile unsigned char           PIR5                __at(0x39A5);
#ifndef _LIB_BUILD
asm("PIR5 equ 039A5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT1IF                 :1;
        unsigned C2IF                   :1;
        unsigned DMA2SCNTIF             :1;
        unsigned DMA2DCNTIF             :1;
        unsigned DMA2ORIF               :1;
        unsigned DMA2AIF                :1;
        unsigned I2C2RXIF               :1;
        unsigned I2C2TXIF               :1;
    };
} PIR5bits_t;
extern volatile PIR5bits_t PIR5bits __at(0x39A5);
// bitfield macros
#define _PIR5_INT1IF_POSN                                   0x0
#define _PIR5_INT1IF_POSITION                               0x0
#define _PIR5_INT1IF_SIZE                                   0x1
#define _PIR5_INT1IF_LENGTH                                 0x1
#define _PIR5_INT1IF_MASK                                   0x1
#define _PIR5_C2IF_POSN                                     0x1
#define _PIR5_C2IF_POSITION                                 0x1
#define _PIR5_C2IF_SIZE                                     0x1
#define _PIR5_C2IF_LENGTH                                   0x1
#define _PIR5_C2IF_MASK                                     0x2
#define _PIR5_DMA2SCNTIF_POSN                               0x2
#define _PIR5_DMA2SCNTIF_POSITION                           0x2
#define _PIR5_DMA2SCNTIF_SIZE                               0x1
#define _PIR5_DMA2SCNTIF_LENGTH                             0x1
#define _PIR5_DMA2SCNTIF_MASK                               0x4
#define _PIR5_DMA2DCNTIF_POSN                               0x3
#define _PIR5_DMA2DCNTIF_POSITION                           0x3
#define _PIR5_DMA2DCNTIF_SIZE                               0x1
#define _PIR5_DMA2DCNTIF_LENGTH                             0x1
#define _PIR5_DMA2DCNTIF_MASK                               0x8
#define _PIR5_DMA2ORIF_POSN                                 0x4
#define _PIR5_DMA2ORIF_POSITION                             0x4
#define _PIR5_DMA2ORIF_SIZE                                 0x1
#define _PIR5_DMA2ORIF_LENGTH                               0x1
#define _PIR5_DMA2ORIF_MASK                                 0x10
#define _PIR5_DMA2AIF_POSN                                  0x5
#define _PIR5_DMA2AIF_POSITION                              0x5
#define _PIR5_DMA2AIF_SIZE                                  0x1
#define _PIR5_DMA2AIF_LENGTH                                0x1
#define _PIR5_DMA2AIF_MASK                                  0x20
#define _PIR5_I2C2RXIF_POSN                                 0x6
#define _PIR5_I2C2RXIF_POSITION                             0x6
#define _PIR5_I2C2RXIF_SIZE                                 0x1
#define _PIR5_I2C2RXIF_LENGTH                               0x1
#define _PIR5_I2C2RXIF_MASK                                 0x40
#define _PIR5_I2C2TXIF_POSN                                 0x7
#define _PIR5_I2C2TXIF_POSITION                             0x7
#define _PIR5_I2C2TXIF_SIZE                                 0x1
#define _PIR5_I2C2TXIF_LENGTH                               0x1
#define _PIR5_I2C2TXIF_MASK                                 0x80

// Register: PIR6
#define PIR6 PIR6
extern volatile unsigned char           PIR6                __at(0x39A6);
#ifndef _LIB_BUILD
asm("PIR6 equ 039A6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C2IF                 :1;
        unsigned I2C2EIF                :1;
        unsigned U2RXIF                 :1;
        unsigned U2TXIF                 :1;
        unsigned U2EIF                  :1;
        unsigned U2IF                   :1;
        unsigned TMR3IF                 :1;
        unsigned TMR3GIF                :1;
    };
} PIR6bits_t;
extern volatile PIR6bits_t PIR6bits __at(0x39A6);
// bitfield macros
#define _PIR6_I2C2IF_POSN                                   0x0
#define _PIR6_I2C2IF_POSITION                               0x0
#define _PIR6_I2C2IF_SIZE                                   0x1
#define _PIR6_I2C2IF_LENGTH                                 0x1
#define _PIR6_I2C2IF_MASK                                   0x1
#define _PIR6_I2C2EIF_POSN                                  0x1
#define _PIR6_I2C2EIF_POSITION                              0x1
#define _PIR6_I2C2EIF_SIZE                                  0x1
#define _PIR6_I2C2EIF_LENGTH                                0x1
#define _PIR6_I2C2EIF_MASK                                  0x2
#define _PIR6_U2RXIF_POSN                                   0x2
#define _PIR6_U2RXIF_POSITION                               0x2
#define _PIR6_U2RXIF_SIZE                                   0x1
#define _PIR6_U2RXIF_LENGTH                                 0x1
#define _PIR6_U2RXIF_MASK                                   0x4
#define _PIR6_U2TXIF_POSN                                   0x3
#define _PIR6_U2TXIF_POSITION                               0x3
#define _PIR6_U2TXIF_SIZE                                   0x1
#define _PIR6_U2TXIF_LENGTH                                 0x1
#define _PIR6_U2TXIF_MASK                                   0x8
#define _PIR6_U2EIF_POSN                                    0x4
#define _PIR6_U2EIF_POSITION                                0x4
#define _PIR6_U2EIF_SIZE                                    0x1
#define _PIR6_U2EIF_LENGTH                                  0x1
#define _PIR6_U2EIF_MASK                                    0x10
#define _PIR6_U2IF_POSN                                     0x5
#define _PIR6_U2IF_POSITION                                 0x5
#define _PIR6_U2IF_SIZE                                     0x1
#define _PIR6_U2IF_LENGTH                                   0x1
#define _PIR6_U2IF_MASK                                     0x20
#define _PIR6_TMR3IF_POSN                                   0x6
#define _PIR6_TMR3IF_POSITION                               0x6
#define _PIR6_TMR3IF_SIZE                                   0x1
#define _PIR6_TMR3IF_LENGTH                                 0x1
#define _PIR6_TMR3IF_MASK                                   0x40
#define _PIR6_TMR3GIF_POSN                                  0x7
#define _PIR6_TMR3GIF_POSITION                              0x7
#define _PIR6_TMR3GIF_SIZE                                  0x1
#define _PIR6_TMR3GIF_LENGTH                                0x1
#define _PIR6_TMR3GIF_MASK                                  0x80

