MikroElektronika/core_packages/PIC/XC8/def/PIC18F25K42/mcu.h
// Register: DMA2DSZ
#define DMA2DSZ DMA2DSZ
extern volatile unsigned short          DMA2DSZ             __at(0x3BCE);
#ifndef _LIB_BUILD
asm("DMA2DSZ equ 03BCEh");
#endif

// Register: DMA2DSZL
#define DMA2DSZL DMA2DSZL
extern volatile unsigned char           DMA2DSZL            __at(0x3BCE);
#ifndef _LIB_BUILD
asm("DMA2DSZL equ 03BCEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSZ                    :8;
    };
    struct {
        unsigned DMA2DSZ                :8;
    };
    struct {
        unsigned DSZ0                   :1;
        unsigned DSZ1                   :1;
        unsigned DSZ2                   :1;
        unsigned DSZ3                   :1;
        unsigned DSZ4                   :1;
        unsigned DSZ5                   :1;
        unsigned DSZ6                   :1;
        unsigned DSZ7                   :1;
    };
    struct {
        unsigned DMA2DSZ0               :1;
        unsigned DMA2DSZ1               :1;
        unsigned DMA2DSZ2               :1;
        unsigned DMA2DSZ3               :1;
        unsigned DMA2DSZ4               :1;
        unsigned DMA2DSZ5               :1;
        unsigned DMA2DSZ6               :1;
        unsigned DMA2DSZ7               :1;
    };
} DMA2DSZLbits_t;
extern volatile DMA2DSZLbits_t DMA2DSZLbits __at(0x3BCE);
// bitfield macros
#define _DMA2DSZL_DSZ_POSN                                  0x0
#define _DMA2DSZL_DSZ_POSITION                              0x0
#define _DMA2DSZL_DSZ_SIZE                                  0x8
#define _DMA2DSZL_DSZ_LENGTH                                0x8
#define _DMA2DSZL_DSZ_MASK                                  0xFF
#define _DMA2DSZL_DMA2DSZ_POSN                              0x0
#define _DMA2DSZL_DMA2DSZ_POSITION                          0x0
#define _DMA2DSZL_DMA2DSZ_SIZE                              0x8
#define _DMA2DSZL_DMA2DSZ_LENGTH                            0x8
#define _DMA2DSZL_DMA2DSZ_MASK                              0xFF
#define _DMA2DSZL_DSZ0_POSN                                 0x0
#define _DMA2DSZL_DSZ0_POSITION                             0x0
#define _DMA2DSZL_DSZ0_SIZE                                 0x1
#define _DMA2DSZL_DSZ0_LENGTH                               0x1
#define _DMA2DSZL_DSZ0_MASK                                 0x1
#define _DMA2DSZL_DSZ1_POSN                                 0x1
#define _DMA2DSZL_DSZ1_POSITION                             0x1
#define _DMA2DSZL_DSZ1_SIZE                                 0x1
#define _DMA2DSZL_DSZ1_LENGTH                               0x1
#define _DMA2DSZL_DSZ1_MASK                                 0x2
#define _DMA2DSZL_DSZ2_POSN                                 0x2
#define _DMA2DSZL_DSZ2_POSITION                             0x2
#define _DMA2DSZL_DSZ2_SIZE                                 0x1
#define _DMA2DSZL_DSZ2_LENGTH                               0x1
#define _DMA2DSZL_DSZ2_MASK                                 0x4
#define _DMA2DSZL_DSZ3_POSN                                 0x3
#define _DMA2DSZL_DSZ3_POSITION                             0x3
#define _DMA2DSZL_DSZ3_SIZE                                 0x1
#define _DMA2DSZL_DSZ3_LENGTH                               0x1
#define _DMA2DSZL_DSZ3_MASK                                 0x8
#define _DMA2DSZL_DSZ4_POSN                                 0x4
#define _DMA2DSZL_DSZ4_POSITION                             0x4
#define _DMA2DSZL_DSZ4_SIZE                                 0x1
#define _DMA2DSZL_DSZ4_LENGTH                               0x1
#define _DMA2DSZL_DSZ4_MASK                                 0x10
#define _DMA2DSZL_DSZ5_POSN                                 0x5
#define _DMA2DSZL_DSZ5_POSITION                             0x5
#define _DMA2DSZL_DSZ5_SIZE                                 0x1
#define _DMA2DSZL_DSZ5_LENGTH                               0x1
#define _DMA2DSZL_DSZ5_MASK                                 0x20
#define _DMA2DSZL_DSZ6_POSN                                 0x6
#define _DMA2DSZL_DSZ6_POSITION                             0x6
#define _DMA2DSZL_DSZ6_SIZE                                 0x1
#define _DMA2DSZL_DSZ6_LENGTH                               0x1
#define _DMA2DSZL_DSZ6_MASK                                 0x40
#define _DMA2DSZL_DSZ7_POSN                                 0x7
#define _DMA2DSZL_DSZ7_POSITION                             0x7
#define _DMA2DSZL_DSZ7_SIZE                                 0x1
#define _DMA2DSZL_DSZ7_LENGTH                               0x1
#define _DMA2DSZL_DSZ7_MASK                                 0x80
#define _DMA2DSZL_DMA2DSZ0_POSN                             0x0
#define _DMA2DSZL_DMA2DSZ0_POSITION                         0x0
#define _DMA2DSZL_DMA2DSZ0_SIZE                             0x1
#define _DMA2DSZL_DMA2DSZ0_LENGTH                           0x1
#define _DMA2DSZL_DMA2DSZ0_MASK                             0x1
#define _DMA2DSZL_DMA2DSZ1_POSN                             0x1
#define _DMA2DSZL_DMA2DSZ1_POSITION                         0x1
#define _DMA2DSZL_DMA2DSZ1_SIZE                             0x1
#define _DMA2DSZL_DMA2DSZ1_LENGTH                           0x1
#define _DMA2DSZL_DMA2DSZ1_MASK                             0x2
#define _DMA2DSZL_DMA2DSZ2_POSN                             0x2
#define _DMA2DSZL_DMA2DSZ2_POSITION                         0x2
#define _DMA2DSZL_DMA2DSZ2_SIZE                             0x1
#define _DMA2DSZL_DMA2DSZ2_LENGTH                           0x1
#define _DMA2DSZL_DMA2DSZ2_MASK                             0x4
#define _DMA2DSZL_DMA2DSZ3_POSN                             0x3
#define _DMA2DSZL_DMA2DSZ3_POSITION                         0x3
#define _DMA2DSZL_DMA2DSZ3_SIZE                             0x1
#define _DMA2DSZL_DMA2DSZ3_LENGTH                           0x1
#define _DMA2DSZL_DMA2DSZ3_MASK                             0x8
#define _DMA2DSZL_DMA2DSZ4_POSN                             0x4
#define _DMA2DSZL_DMA2DSZ4_POSITION                         0x4
#define _DMA2DSZL_DMA2DSZ4_SIZE                             0x1
#define _DMA2DSZL_DMA2DSZ4_LENGTH                           0x1
#define _DMA2DSZL_DMA2DSZ4_MASK                             0x10
#define _DMA2DSZL_DMA2DSZ5_POSN                             0x5
#define _DMA2DSZL_DMA2DSZ5_POSITION                         0x5
#define _DMA2DSZL_DMA2DSZ5_SIZE                             0x1
#define _DMA2DSZL_DMA2DSZ5_LENGTH                           0x1
#define _DMA2DSZL_DMA2DSZ5_MASK                             0x20
#define _DMA2DSZL_DMA2DSZ6_POSN                             0x6
#define _DMA2DSZL_DMA2DSZ6_POSITION                         0x6
#define _DMA2DSZL_DMA2DSZ6_SIZE                             0x1
#define _DMA2DSZL_DMA2DSZ6_LENGTH                           0x1
#define _DMA2DSZL_DMA2DSZ6_MASK                             0x40
#define _DMA2DSZL_DMA2DSZ7_POSN                             0x7
#define _DMA2DSZL_DMA2DSZ7_POSITION                         0x7
#define _DMA2DSZL_DMA2DSZ7_SIZE                             0x1
#define _DMA2DSZL_DMA2DSZ7_LENGTH                           0x1
#define _DMA2DSZL_DMA2DSZ7_MASK                             0x80

// Register: DMA2DSZH
#define DMA2DSZH DMA2DSZH
extern volatile unsigned char           DMA2DSZH            __at(0x3BCF);
#ifndef _LIB_BUILD
asm("DMA2DSZH equ 03BCFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSZ                    :4;
    };
    struct {
        unsigned DMA2DSZ                :4;
    };
    struct {
        unsigned DSZ8                   :1;
        unsigned DSZ9                   :1;
        unsigned DSZ10                  :1;
        unsigned DSZ11                  :1;
    };
    struct {
        unsigned DMA2DSZ8               :1;
        unsigned DMA2DSZ9               :1;
        unsigned DMA2DSZ10              :1;
        unsigned DMA2DSZ11              :1;
    };
} DMA2DSZHbits_t;
extern volatile DMA2DSZHbits_t DMA2DSZHbits __at(0x3BCF);
// bitfield macros
#define _DMA2DSZH_DSZ_POSN                                  0x0
#define _DMA2DSZH_DSZ_POSITION                              0x0
#define _DMA2DSZH_DSZ_SIZE                                  0x4
#define _DMA2DSZH_DSZ_LENGTH                                0x4
#define _DMA2DSZH_DSZ_MASK                                  0xF
#define _DMA2DSZH_DMA2DSZ_POSN                              0x0
#define _DMA2DSZH_DMA2DSZ_POSITION                          0x0
#define _DMA2DSZH_DMA2DSZ_SIZE                              0x4
#define _DMA2DSZH_DMA2DSZ_LENGTH                            0x4
#define _DMA2DSZH_DMA2DSZ_MASK                              0xF
#define _DMA2DSZH_DSZ8_POSN                                 0x0
#define _DMA2DSZH_DSZ8_POSITION                             0x0
#define _DMA2DSZH_DSZ8_SIZE                                 0x1
#define _DMA2DSZH_DSZ8_LENGTH                               0x1
#define _DMA2DSZH_DSZ8_MASK                                 0x1
#define _DMA2DSZH_DSZ9_POSN                                 0x1
#define _DMA2DSZH_DSZ9_POSITION                             0x1
#define _DMA2DSZH_DSZ9_SIZE                                 0x1
#define _DMA2DSZH_DSZ9_LENGTH                               0x1
#define _DMA2DSZH_DSZ9_MASK                                 0x2
#define _DMA2DSZH_DSZ10_POSN                                0x2
#define _DMA2DSZH_DSZ10_POSITION                            0x2
#define _DMA2DSZH_DSZ10_SIZE                                0x1
#define _DMA2DSZH_DSZ10_LENGTH                              0x1
#define _DMA2DSZH_DSZ10_MASK                                0x4
#define _DMA2DSZH_DSZ11_POSN                                0x3
#define _DMA2DSZH_DSZ11_POSITION                            0x3
#define _DMA2DSZH_DSZ11_SIZE                                0x1
#define _DMA2DSZH_DSZ11_LENGTH                              0x1
#define _DMA2DSZH_DSZ11_MASK                                0x8
#define _DMA2DSZH_DMA2DSZ8_POSN                             0x0
#define _DMA2DSZH_DMA2DSZ8_POSITION                         0x0
#define _DMA2DSZH_DMA2DSZ8_SIZE                             0x1
#define _DMA2DSZH_DMA2DSZ8_LENGTH                           0x1
#define _DMA2DSZH_DMA2DSZ8_MASK                             0x1
#define _DMA2DSZH_DMA2DSZ9_POSN                             0x1
#define _DMA2DSZH_DMA2DSZ9_POSITION                         0x1
#define _DMA2DSZH_DMA2DSZ9_SIZE                             0x1
#define _DMA2DSZH_DMA2DSZ9_LENGTH                           0x1
#define _DMA2DSZH_DMA2DSZ9_MASK                             0x2
#define _DMA2DSZH_DMA2DSZ10_POSN                            0x2
#define _DMA2DSZH_DMA2DSZ10_POSITION                        0x2
#define _DMA2DSZH_DMA2DSZ10_SIZE                            0x1
#define _DMA2DSZH_DMA2DSZ10_LENGTH                          0x1
#define _DMA2DSZH_DMA2DSZ10_MASK                            0x4
#define _DMA2DSZH_DMA2DSZ11_POSN                            0x3
#define _DMA2DSZH_DMA2DSZ11_POSITION                        0x3
#define _DMA2DSZH_DMA2DSZ11_SIZE                            0x1
#define _DMA2DSZH_DMA2DSZ11_LENGTH                          0x1
#define _DMA2DSZH_DMA2DSZ11_MASK                            0x8

