MikroElektronika/core_packages/PIC/XC8/def/PIC18F25K42/mcu.h
extern volatile U1CON2bits_t U1CON2bits __at(0x3DF4);
// bitfield macros
#define _U1CON2_FLO_POSN                                    0x0
#define _U1CON2_FLO_POSITION                                0x0
#define _U1CON2_FLO_SIZE                                    0x2
#define _U1CON2_FLO_LENGTH                                  0x2
#define _U1CON2_FLO_MASK                                    0x3
#define _U1CON2_TXPOL_POSN                                  0x2
#define _U1CON2_TXPOL_POSITION                              0x2
#define _U1CON2_TXPOL_SIZE                                  0x1
#define _U1CON2_TXPOL_LENGTH                                0x1
#define _U1CON2_TXPOL_MASK                                  0x4
#define _U1CON2_C0EN_POSN                                   0x3
#define _U1CON2_C0EN_POSITION                               0x3
#define _U1CON2_C0EN_SIZE                                   0x1
#define _U1CON2_C0EN_LENGTH                                 0x1
#define _U1CON2_C0EN_MASK                                   0x8
#define _U1CON2_STP_POSN                                    0x4
#define _U1CON2_STP_POSITION                                0x4
#define _U1CON2_STP_SIZE                                    0x2
#define _U1CON2_STP_LENGTH                                  0x2
#define _U1CON2_STP_MASK                                    0x30
#define _U1CON2_RXPOL_POSN                                  0x6
#define _U1CON2_RXPOL_POSITION                              0x6
#define _U1CON2_RXPOL_SIZE                                  0x1
#define _U1CON2_RXPOL_LENGTH                                0x1
#define _U1CON2_RXPOL_MASK                                  0x40
#define _U1CON2_RUNOVF_POSN                                 0x7
#define _U1CON2_RUNOVF_POSITION                             0x7
#define _U1CON2_RUNOVF_SIZE                                 0x1
#define _U1CON2_RUNOVF_LENGTH                               0x1
#define _U1CON2_RUNOVF_MASK                                 0x80
#define _U1CON2_FLO0_POSN                                   0x0
#define _U1CON2_FLO0_POSITION                               0x0
#define _U1CON2_FLO0_SIZE                                   0x1
#define _U1CON2_FLO0_LENGTH                                 0x1
#define _U1CON2_FLO0_MASK                                   0x1
#define _U1CON2_FLO1_POSN                                   0x1
#define _U1CON2_FLO1_POSITION                               0x1
#define _U1CON2_FLO1_SIZE                                   0x1
#define _U1CON2_FLO1_LENGTH                                 0x1
#define _U1CON2_FLO1_MASK                                   0x2
#define _U1CON2_STP0_POSN                                   0x4
#define _U1CON2_STP0_POSITION                               0x4
#define _U1CON2_STP0_SIZE                                   0x1
#define _U1CON2_STP0_LENGTH                                 0x1
#define _U1CON2_STP0_MASK                                   0x10
#define _U1CON2_STP1_POSN                                   0x5
#define _U1CON2_STP1_POSITION                               0x5
#define _U1CON2_STP1_SIZE                                   0x1
#define _U1CON2_STP1_LENGTH                                 0x1
#define _U1CON2_STP1_MASK                                   0x20
#define _U1CON2_U1FLO_POSN                                  0x0
#define _U1CON2_U1FLO_POSITION                              0x0
#define _U1CON2_U1FLO_SIZE                                  0x2
#define _U1CON2_U1FLO_LENGTH                                0x2
#define _U1CON2_U1FLO_MASK                                  0x3
#define _U1CON2_U1TXPOL_POSN                                0x2
#define _U1CON2_U1TXPOL_POSITION                            0x2
#define _U1CON2_U1TXPOL_SIZE                                0x1
#define _U1CON2_U1TXPOL_LENGTH                              0x1
#define _U1CON2_U1TXPOL_MASK                                0x4
#define _U1CON2_U1C0EN_POSN                                 0x3
#define _U1CON2_U1C0EN_POSITION                             0x3
#define _U1CON2_U1C0EN_SIZE                                 0x1
#define _U1CON2_U1C0EN_LENGTH                               0x1
#define _U1CON2_U1C0EN_MASK                                 0x8
#define _U1CON2_U1STP_POSN                                  0x4
#define _U1CON2_U1STP_POSITION                              0x4
#define _U1CON2_U1STP_SIZE                                  0x2
#define _U1CON2_U1STP_LENGTH                                0x2
#define _U1CON2_U1STP_MASK                                  0x30
#define _U1CON2_U1RXPOL_POSN                                0x6
#define _U1CON2_U1RXPOL_POSITION                            0x6
#define _U1CON2_U1RXPOL_SIZE                                0x1
#define _U1CON2_U1RXPOL_LENGTH                              0x1
#define _U1CON2_U1RXPOL_MASK                                0x40
#define _U1CON2_U1RUNOVF_POSN                               0x7
#define _U1CON2_U1RUNOVF_POSITION                           0x7
#define _U1CON2_U1RUNOVF_SIZE                               0x1
#define _U1CON2_U1RUNOVF_LENGTH                             0x1
#define _U1CON2_U1RUNOVF_MASK                               0x80
#define _U1CON2_U1FLO0_POSN                                 0x0
#define _U1CON2_U1FLO0_POSITION                             0x0
#define _U1CON2_U1FLO0_SIZE                                 0x1
#define _U1CON2_U1FLO0_LENGTH                               0x1
#define _U1CON2_U1FLO0_MASK                                 0x1
#define _U1CON2_U1FLO1_POSN                                 0x1
#define _U1CON2_U1FLO1_POSITION                             0x1
#define _U1CON2_U1FLO1_SIZE                                 0x1
#define _U1CON2_U1FLO1_LENGTH                               0x1
#define _U1CON2_U1FLO1_MASK                                 0x2
#define _U1CON2_U1STP0_POSN                                 0x4
#define _U1CON2_U1STP0_POSITION                             0x4
#define _U1CON2_U1STP0_SIZE                                 0x1
#define _U1CON2_U1STP0_LENGTH                               0x1
#define _U1CON2_U1STP0_MASK                                 0x10
#define _U1CON2_U1STP1_POSN                                 0x5
#define _U1CON2_U1STP1_POSITION                             0x5
#define _U1CON2_U1STP1_SIZE                                 0x1
#define _U1CON2_U1STP1_LENGTH                               0x1
#define _U1CON2_U1STP1_MASK                                 0x20

// Register: U1BRG
#define U1BRG U1BRG
extern volatile unsigned short          U1BRG               __at(0x3DF5);
#ifndef _LIB_BUILD
asm("U1BRG equ 03DF5h");
#endif

// Register: U1BRGL
#define U1BRGL U1BRGL
extern volatile unsigned char           U1BRGL              __at(0x3DF5);
#ifndef _LIB_BUILD
asm("U1BRGL equ 03DF5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BRGL                   :8;
    };
} U1BRGLbits_t;
extern volatile U1BRGLbits_t U1BRGLbits __at(0x3DF5);
// bitfield macros
#define _U1BRGL_BRGL_POSN                                   0x0
#define _U1BRGL_BRGL_POSITION                               0x0
#define _U1BRGL_BRGL_SIZE                                   0x8
#define _U1BRGL_BRGL_LENGTH                                 0x8
#define _U1BRGL_BRGL_MASK                                   0xFF

// Register: U1BRGH
#define U1BRGH U1BRGH
extern volatile unsigned char           U1BRGH              __at(0x3DF6);
#ifndef _LIB_BUILD
asm("U1BRGH equ 03DF6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BRGH                   :8;
    };
} U1BRGHbits_t;
extern volatile U1BRGHbits_t U1BRGHbits __at(0x3DF6);
// bitfield macros
#define _U1BRGH_BRGH_POSN                                   0x0
#define _U1BRGH_BRGH_POSITION                               0x0
#define _U1BRGH_BRGH_SIZE                                   0x8
#define _U1BRGH_BRGH_LENGTH                                 0x8
#define _U1BRGH_BRGH_MASK                                   0xFF

// Register: U1FIFO
#define U1FIFO U1FIFO
extern volatile unsigned char           U1FIFO              __at(0x3DF7);
#ifndef _LIB_BUILD
asm("U1FIFO equ 03DF7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXBF                   :1;
        unsigned RXBE                   :1;
        unsigned XON                    :1;
        unsigned RXIDL                  :1;
        unsigned TXBF                   :1;
        unsigned TXBE                   :1;
        unsigned STPMD                  :1;
        unsigned TXWRE                  :1;
    };
    struct {
        unsigned U1RXBF                 :1;
        unsigned U1RXBE                 :1;
        unsigned U1XON                  :1;
        unsigned U1RXIDL                :1;
        unsigned U1TXBF                 :1;
        unsigned U1TXBE                 :1;
        unsigned U1STPMD                :1;
        unsigned U1TXWRE                :1;
    };
    struct {
        unsigned                        :3;
        unsigned U1RCIDL                :1;
    };
    struct {
        unsigned                        :3;
        unsigned RCIDL                  :1;
    };
} U1FIFObits_t;
