MikroElektronika/core_packages/PIC/XC8/def/PIC18F25K42/mcu.h
extern volatile __bit                   I2C1RXIE            __at(0x1CC97);	// @ (0x3992 * 8 + 7)
#define                                 I2C1RXIE_bit        _BIT_ACCESS(PIE2,7)
// PIR2<I2C1RXIF>
extern volatile __bit                   I2C1RXIF            __at(0x1CD17);	// @ (0x39A2 * 8 + 7)
#define                                 I2C1RXIF_bit        _BIT_ACCESS(PIR2,7)
// IPR2<I2C1RXIP>
extern volatile __bit                   I2C1RXIP            __at(0x1CC17);	// @ (0x3982 * 8 + 7)
#define                                 I2C1RXIP_bit        _BIT_ACCESS(IPR2,7)
// PIE3<I2C1TXIE>
extern volatile __bit                   I2C1TXIE            __at(0x1CC98);	// @ (0x3993 * 8 + 0)
#define                                 I2C1TXIE_bit        _BIT_ACCESS(PIE3,0)
// PIR3<I2C1TXIF>
extern volatile __bit                   I2C1TXIF            __at(0x1CD18);	// @ (0x39A3 * 8 + 0)
#define                                 I2C1TXIF_bit        _BIT_ACCESS(PIR3,0)
// IPR3<I2C1TXIP>
extern volatile __bit                   I2C1TXIP            __at(0x1CC18);	// @ (0x3983 * 8 + 0)
#define                                 I2C1TXIP_bit        _BIT_ACCESS(IPR3,0)
// PIE6<I2C2EIE>
extern volatile __bit                   I2C2EIE             __at(0x1CCB1);	// @ (0x3996 * 8 + 1)
#define                                 I2C2EIE_bit         _BIT_ACCESS(PIE6,1)
// PIR6<I2C2EIF>
extern volatile __bit                   I2C2EIF             __at(0x1CD31);	// @ (0x39A6 * 8 + 1)
#define                                 I2C2EIF_bit         _BIT_ACCESS(PIR6,1)
// IPR6<I2C2EIP>
extern volatile __bit                   I2C2EIP             __at(0x1CC31);	// @ (0x3986 * 8 + 1)
#define                                 I2C2EIP_bit         _BIT_ACCESS(IPR6,1)
// PIE6<I2C2IE>
extern volatile __bit                   I2C2IE              __at(0x1CCB0);	// @ (0x3996 * 8 + 0)
#define                                 I2C2IE_bit          _BIT_ACCESS(PIE6,0)
// PIR6<I2C2IF>
extern volatile __bit                   I2C2IF              __at(0x1CD30);	// @ (0x39A6 * 8 + 0)
#define                                 I2C2IF_bit          _BIT_ACCESS(PIR6,0)
// IPR6<I2C2IP>
extern volatile __bit                   I2C2IP              __at(0x1CC30);	// @ (0x3986 * 8 + 0)
#define                                 I2C2IP_bit          _BIT_ACCESS(IPR6,0)
// PMD5<I2C2MD>
extern volatile __bit                   I2C2MD              __at(0x1CE29);	// @ (0x39C5 * 8 + 1)
#define                                 I2C2MD_bit          _BIT_ACCESS(PMD5,1)
// PIE5<I2C2RXIE>
extern volatile __bit                   I2C2RXIE            __at(0x1CCAE);	// @ (0x3995 * 8 + 6)
#define                                 I2C2RXIE_bit        _BIT_ACCESS(PIE5,6)
// PIR5<I2C2RXIF>
extern volatile __bit                   I2C2RXIF            __at(0x1CD2E);	// @ (0x39A5 * 8 + 6)
#define                                 I2C2RXIF_bit        _BIT_ACCESS(PIR5,6)
// IPR5<I2C2RXIP>
extern volatile __bit                   I2C2RXIP            __at(0x1CC2E);	// @ (0x3985 * 8 + 6)
#define                                 I2C2RXIP_bit        _BIT_ACCESS(IPR5,6)
// PIE5<I2C2TXIE>
extern volatile __bit                   I2C2TXIE            __at(0x1CCAF);	// @ (0x3995 * 8 + 7)
#define                                 I2C2TXIE_bit        _BIT_ACCESS(PIE5,7)
// PIR5<I2C2TXIF>
extern volatile __bit                   I2C2TXIF            __at(0x1CD2F);	// @ (0x39A5 * 8 + 7)
#define                                 I2C2TXIF_bit        _BIT_ACCESS(PIR5,7)
// IPR5<I2C2TXIP>
extern volatile __bit                   I2C2TXIP            __at(0x1CC2F);	// @ (0x3985 * 8 + 7)
#define                                 I2C2TXIP_bit        _BIT_ACCESS(IPR5,7)
// CPUDOZE<IDLEN>
extern volatile __bit                   IDLEN               __at(0x1CEC7);	// @ (0x39D8 * 8 + 7)
#define                                 IDLEN_bit           _BIT_ACCESS(CPUDOZE,7)
// NCO1INCL<INC0>
extern volatile __bit                   INC0                __at(0x1F9D8);	// @ (0x3F3B * 8 + 0)
#define                                 INC0_bit            _BIT_ACCESS(NCO1INCL,0)
// NCO1INCL<INC1>
extern volatile __bit                   INC1                __at(0x1F9D9);	// @ (0x3F3B * 8 + 1)
#define                                 INC1_bit            _BIT_ACCESS(NCO1INCL,1)
// NCO1INCH<INC10>
extern volatile __bit                   INC10               __at(0x1F9E2);	// @ (0x3F3C * 8 + 2)
#define                                 INC10_bit           _BIT_ACCESS(NCO1INCH,2)
// NCO1INCH<INC11>
extern volatile __bit                   INC11               __at(0x1F9E3);	// @ (0x3F3C * 8 + 3)
#define                                 INC11_bit           _BIT_ACCESS(NCO1INCH,3)
// NCO1INCH<INC12>
extern volatile __bit                   INC12               __at(0x1F9E4);	// @ (0x3F3C * 8 + 4)
#define                                 INC12_bit           _BIT_ACCESS(NCO1INCH,4)
// NCO1INCH<INC13>
extern volatile __bit                   INC13               __at(0x1F9E5);	// @ (0x3F3C * 8 + 5)
#define                                 INC13_bit           _BIT_ACCESS(NCO1INCH,5)
// NCO1INCH<INC14>
extern volatile __bit                   INC14               __at(0x1F9E6);	// @ (0x3F3C * 8 + 6)
#define                                 INC14_bit           _BIT_ACCESS(NCO1INCH,6)
// NCO1INCH<INC15>
extern volatile __bit                   INC15               __at(0x1F9E7);	// @ (0x3F3C * 8 + 7)
#define                                 INC15_bit           _BIT_ACCESS(NCO1INCH,7)
// NCO1INCU<INC16>
extern volatile __bit                   INC16               __at(0x1F9E8);	// @ (0x3F3D * 8 + 0)
#define                                 INC16_bit           _BIT_ACCESS(NCO1INCU,0)
// NCO1INCU<INC17>
extern volatile __bit                   INC17               __at(0x1F9E9);	// @ (0x3F3D * 8 + 1)
#define                                 INC17_bit           _BIT_ACCESS(NCO1INCU,1)
// NCO1INCU<INC18>
extern volatile __bit                   INC18               __at(0x1F9EA);	// @ (0x3F3D * 8 + 2)
#define                                 INC18_bit           _BIT_ACCESS(NCO1INCU,2)
// NCO1INCU<INC19>
extern volatile __bit                   INC19               __at(0x1F9EB);	// @ (0x3F3D * 8 + 3)
#define                                 INC19_bit           _BIT_ACCESS(NCO1INCU,3)
// NCO1INCL<INC2>
extern volatile __bit                   INC2                __at(0x1F9DA);	// @ (0x3F3B * 8 + 2)
#define                                 INC2_bit            _BIT_ACCESS(NCO1INCL,2)
// NCO1INCL<INC3>
extern volatile __bit                   INC3                __at(0x1F9DB);	// @ (0x3F3B * 8 + 3)
#define                                 INC3_bit            _BIT_ACCESS(NCO1INCL,3)
// NCO1INCL<INC4>
extern volatile __bit                   INC4                __at(0x1F9DC);	// @ (0x3F3B * 8 + 4)
#define                                 INC4_bit            _BIT_ACCESS(NCO1INCL,4)
// NCO1INCL<INC5>
extern volatile __bit                   INC5                __at(0x1F9DD);	// @ (0x3F3B * 8 + 5)
#define                                 INC5_bit            _BIT_ACCESS(NCO1INCL,5)
// NCO1INCL<INC6>
extern volatile __bit                   INC6                __at(0x1F9DE);	// @ (0x3F3B * 8 + 6)
#define                                 INC6_bit            _BIT_ACCESS(NCO1INCL,6)
// NCO1INCL<INC7>
extern volatile __bit                   INC7                __at(0x1F9DF);	// @ (0x3F3B * 8 + 7)
#define                                 INC7_bit            _BIT_ACCESS(NCO1INCL,7)
// NCO1INCH<INC8>
extern volatile __bit                   INC8                __at(0x1F9E0);	// @ (0x3F3C * 8 + 0)
#define                                 INC8_bit            _BIT_ACCESS(NCO1INCH,0)
// NCO1INCH<INC9>
extern volatile __bit                   INC9                __at(0x1F9E1);	// @ (0x3F3C * 8 + 1)
#define                                 INC9_bit            _BIT_ACCESS(NCO1INCH,1)
// INLVLA<INLVLA0>
extern volatile __bit                   INLVLA0             __at(0x1D220);	// @ (0x3A44 * 8 + 0)
#define                                 INLVLA0_bit         _BIT_ACCESS(INLVLA,0)
// INLVLA<INLVLA1>
extern volatile __bit                   INLVLA1             __at(0x1D221);	// @ (0x3A44 * 8 + 1)
#define                                 INLVLA1_bit         _BIT_ACCESS(INLVLA,1)
// INLVLA<INLVLA2>
extern volatile __bit                   INLVLA2             __at(0x1D222);	// @ (0x3A44 * 8 + 2)
#define                                 INLVLA2_bit         _BIT_ACCESS(INLVLA,2)
// INLVLA<INLVLA3>
extern volatile __bit                   INLVLA3             __at(0x1D223);	// @ (0x3A44 * 8 + 3)
#define                                 INLVLA3_bit         _BIT_ACCESS(INLVLA,3)
// INLVLA<INLVLA4>
extern volatile __bit                   INLVLA4             __at(0x1D224);	// @ (0x3A44 * 8 + 4)
#define                                 INLVLA4_bit         _BIT_ACCESS(INLVLA,4)
// INLVLA<INLVLA5>
extern volatile __bit                   INLVLA5             __at(0x1D225);	// @ (0x3A44 * 8 + 5)
#define                                 INLVLA5_bit         _BIT_ACCESS(INLVLA,5)
// INLVLA<INLVLA6>
extern volatile __bit                   INLVLA6             __at(0x1D226);	// @ (0x3A44 * 8 + 6)
#define                                 INLVLA6_bit         _BIT_ACCESS(INLVLA,6)
// INLVLA<INLVLA7>
extern volatile __bit                   INLVLA7             __at(0x1D227);	// @ (0x3A44 * 8 + 7)
#define                                 INLVLA7_bit         _BIT_ACCESS(INLVLA,7)
// INLVLB<INLVLB0>
extern volatile __bit                   INLVLB0             __at(0x1D2A0);	// @ (0x3A54 * 8 + 0)
#define                                 INLVLB0_bit         _BIT_ACCESS(INLVLB,0)
// INLVLB<INLVLB1>
extern volatile __bit                   INLVLB1             __at(0x1D2A1);	// @ (0x3A54 * 8 + 1)
#define                                 INLVLB1_bit         _BIT_ACCESS(INLVLB,1)
// INLVLB<INLVLB2>
extern volatile __bit                   INLVLB2             __at(0x1D2A2);	// @ (0x3A54 * 8 + 2)
#define                                 INLVLB2_bit         _BIT_ACCESS(INLVLB,2)
// INLVLB<INLVLB3>
extern volatile __bit                   INLVLB3             __at(0x1D2A3);	// @ (0x3A54 * 8 + 3)
#define                                 INLVLB3_bit         _BIT_ACCESS(INLVLB,3)
// INLVLB<INLVLB4>
extern volatile __bit                   INLVLB4             __at(0x1D2A4);	// @ (0x3A54 * 8 + 4)
#define                                 INLVLB4_bit         _BIT_ACCESS(INLVLB,4)
// INLVLB<INLVLB5>
extern volatile __bit                   INLVLB5             __at(0x1D2A5);	// @ (0x3A54 * 8 + 5)
#define                                 INLVLB5_bit         _BIT_ACCESS(INLVLB,5)
// INLVLB<INLVLB6>
extern volatile __bit                   INLVLB6             __at(0x1D2A6);	// @ (0x3A54 * 8 + 6)
#define                                 INLVLB6_bit         _BIT_ACCESS(INLVLB,6)
// INLVLB<INLVLB7>
extern volatile __bit                   INLVLB7             __at(0x1D2A7);	// @ (0x3A54 * 8 + 7)
#define                                 INLVLB7_bit         _BIT_ACCESS(INLVLB,7)
// INLVLC<INLVLC0>
extern volatile __bit                   INLVLC0             __at(0x1D320);	// @ (0x3A64 * 8 + 0)
#define                                 INLVLC0_bit         _BIT_ACCESS(INLVLC,0)
// INLVLC<INLVLC1>
extern volatile __bit                   INLVLC1             __at(0x1D321);	// @ (0x3A64 * 8 + 1)
#define                                 INLVLC1_bit         _BIT_ACCESS(INLVLC,1)
// INLVLC<INLVLC2>
extern volatile __bit                   INLVLC2             __at(0x1D322);	// @ (0x3A64 * 8 + 2)
#define                                 INLVLC2_bit         _BIT_ACCESS(INLVLC,2)
// INLVLC<INLVLC3>
extern volatile __bit                   INLVLC3             __at(0x1D323);	// @ (0x3A64 * 8 + 3)
#define                                 INLVLC3_bit         _BIT_ACCESS(INLVLC,3)
// INLVLC<INLVLC4>
extern volatile __bit                   INLVLC4             __at(0x1D324);	// @ (0x3A64 * 8 + 4)
#define                                 INLVLC4_bit         _BIT_ACCESS(INLVLC,4)
// INLVLC<INLVLC5>
extern volatile __bit                   INLVLC5             __at(0x1D325);	// @ (0x3A64 * 8 + 5)
#define                                 INLVLC5_bit         _BIT_ACCESS(INLVLC,5)
// INLVLC<INLVLC6>
extern volatile __bit                   INLVLC6             __at(0x1D326);	// @ (0x3A64 * 8 + 6)
#define                                 INLVLC6_bit         _BIT_ACCESS(INLVLC,6)
// INLVLC<INLVLC7>
extern volatile __bit                   INLVLC7             __at(0x1D327);	// @ (0x3A64 * 8 + 7)
#define                                 INLVLC7_bit         _BIT_ACCESS(INLVLC,7)
// INLVLE<INLVLE3>
extern volatile __bit                   INLVLE3             __at(0x1D423);	// @ (0x3A84 * 8 + 3)
#define                                 INLVLE3_bit         _BIT_ACCESS(INLVLE,3)
// INTCON0<INT0EDG>
extern volatile __bit                   INT0EDG             __at(0x1FE90);	// @ (0x3FD2 * 8 + 0)
#define                                 INT0EDG_bit         _BIT_ACCESS(INTCON0,0)
// PIE1<INT0IE>
extern volatile __bit                   INT0IE              __at(0x1CC88);	// @ (0x3991 * 8 + 0)
#define                                 INT0IE_bit          _BIT_ACCESS(PIE1,0)
// PIR1<INT0IF>
extern volatile __bit                   INT0IF              __at(0x1CD08);	// @ (0x39A1 * 8 + 0)
#define                                 INT0IF_bit          _BIT_ACCESS(PIR1,0)
// IPR1<INT0IP>
extern volatile __bit                   INT0IP              __at(0x1CC08);	// @ (0x3981 * 8 + 0)
#define                                 INT0IP_bit          _BIT_ACCESS(IPR1,0)
// INTCON0<INT1EDG>
extern volatile __bit                   INT1EDG             __at(0x1FE91);	// @ (0x3FD2 * 8 + 1)
#define                                 INT1EDG_bit         _BIT_ACCESS(INTCON0,1)
// PIE5<INT1IE>
extern volatile __bit                   INT1IE              __at(0x1CCA8);	// @ (0x3995 * 8 + 0)
#define                                 INT1IE_bit          _BIT_ACCESS(PIE5,0)
// PIR5<INT1IF>
extern volatile __bit                   INT1IF              __at(0x1CD28);	// @ (0x39A5 * 8 + 0)
#define                                 INT1IF_bit          _BIT_ACCESS(PIR5,0)
// IPR5<INT1IP>
extern volatile __bit                   INT1IP              __at(0x1CC28);	// @ (0x3985 * 8 + 0)
#define                                 INT1IP_bit          _BIT_ACCESS(IPR5,0)
// INTCON0<INT2EDG>
extern volatile __bit                   INT2EDG             __at(0x1FE92);	// @ (0x3FD2 * 8 + 2)
#define                                 INT2EDG_bit         _BIT_ACCESS(INTCON0,2)
// PIE7<INT2IE>
extern volatile __bit                   INT2IE              __at(0x1CCBD);	// @ (0x3997 * 8 + 5)
#define                                 INT2IE_bit          _BIT_ACCESS(PIE7,5)
// PIR7<INT2IF>
extern volatile __bit                   INT2IF              __at(0x1CD3D);	// @ (0x39A7 * 8 + 5)
#define                                 INT2IF_bit          _BIT_ACCESS(PIR7,5)
// IPR7<INT2IP>
extern volatile __bit                   INT2IP              __at(0x1CC3D);	// @ (0x3987 * 8 + 5)
#define                                 INT2IP_bit          _BIT_ACCESS(IPR7,5)
// HLVDCON0<INTH>
extern volatile __bit                   INTH                __at(0x1F649);	// @ (0x3EC9 * 8 + 1)
#define                                 INTH_bit            _BIT_ACCESS(HLVDCON0,1)
// HLVDCON0<INTL>
extern volatile __bit                   INTL                __at(0x1F648);	// @ (0x3EC9 * 8 + 0)
#define                                 INTL_bit            _BIT_ACCESS(HLVDCON0,0)
// IOCAF<IOCAF0>
extern volatile __bit                   IOCAF0              __at(0x1D238);	// @ (0x3A47 * 8 + 0)
#define                                 IOCAF0_bit          _BIT_ACCESS(IOCAF,0)
// IOCAF<IOCAF1>
extern volatile __bit                   IOCAF1              __at(0x1D239);	// @ (0x3A47 * 8 + 1)
#define                                 IOCAF1_bit          _BIT_ACCESS(IOCAF,1)
// IOCAF<IOCAF2>
extern volatile __bit                   IOCAF2              __at(0x1D23A);	// @ (0x3A47 * 8 + 2)
#define                                 IOCAF2_bit          _BIT_ACCESS(IOCAF,2)
// IOCAF<IOCAF3>
extern volatile __bit                   IOCAF3              __at(0x1D23B);	// @ (0x3A47 * 8 + 3)
#define                                 IOCAF3_bit          _BIT_ACCESS(IOCAF,3)
// IOCAF<IOCAF4>
extern volatile __bit                   IOCAF4              __at(0x1D23C);	// @ (0x3A47 * 8 + 4)
#define                                 IOCAF4_bit          _BIT_ACCESS(IOCAF,4)
// IOCAF<IOCAF5>
extern volatile __bit                   IOCAF5              __at(0x1D23D);	// @ (0x3A47 * 8 + 5)
#define                                 IOCAF5_bit          _BIT_ACCESS(IOCAF,5)
// IOCAF<IOCAF6>
extern volatile __bit                   IOCAF6              __at(0x1D23E);	// @ (0x3A47 * 8 + 6)
#define                                 IOCAF6_bit          _BIT_ACCESS(IOCAF,6)
// IOCAF<IOCAF7>
extern volatile __bit                   IOCAF7              __at(0x1D23F);	// @ (0x3A47 * 8 + 7)
#define                                 IOCAF7_bit          _BIT_ACCESS(IOCAF,7)
// IOCAN<IOCAN0>
extern volatile __bit                   IOCAN0              __at(0x1D230);	// @ (0x3A46 * 8 + 0)
#define                                 IOCAN0_bit          _BIT_ACCESS(IOCAN,0)
// IOCAN<IOCAN1>
extern volatile __bit                   IOCAN1              __at(0x1D231);	// @ (0x3A46 * 8 + 1)
#define                                 IOCAN1_bit          _BIT_ACCESS(IOCAN,1)
// IOCAN<IOCAN2>
extern volatile __bit                   IOCAN2              __at(0x1D232);	// @ (0x3A46 * 8 + 2)
#define                                 IOCAN2_bit          _BIT_ACCESS(IOCAN,2)
// IOCAN<IOCAN3>
extern volatile __bit                   IOCAN3              __at(0x1D233);	// @ (0x3A46 * 8 + 3)
#define                                 IOCAN3_bit          _BIT_ACCESS(IOCAN,3)
// IOCAN<IOCAN4>
extern volatile __bit                   IOCAN4              __at(0x1D234);	// @ (0x3A46 * 8 + 4)
#define                                 IOCAN4_bit          _BIT_ACCESS(IOCAN,4)
// IOCAN<IOCAN5>
extern volatile __bit                   IOCAN5              __at(0x1D235);	// @ (0x3A46 * 8 + 5)
#define                                 IOCAN5_bit          _BIT_ACCESS(IOCAN,5)
// IOCAN<IOCAN6>
extern volatile __bit                   IOCAN6              __at(0x1D236);	// @ (0x3A46 * 8 + 6)
#define                                 IOCAN6_bit          _BIT_ACCESS(IOCAN,6)
// IOCAN<IOCAN7>
extern volatile __bit                   IOCAN7              __at(0x1D237);	// @ (0x3A46 * 8 + 7)
#define                                 IOCAN7_bit          _BIT_ACCESS(IOCAN,7)
// IOCAP<IOCAP0>
extern volatile __bit                   IOCAP0              __at(0x1D228);	// @ (0x3A45 * 8 + 0)
#define                                 IOCAP0_bit          _BIT_ACCESS(IOCAP,0)
// IOCAP<IOCAP1>
extern volatile __bit                   IOCAP1              __at(0x1D229);	// @ (0x3A45 * 8 + 1)
#define                                 IOCAP1_bit          _BIT_ACCESS(IOCAP,1)
// IOCAP<IOCAP2>
extern volatile __bit                   IOCAP2              __at(0x1D22A);	// @ (0x3A45 * 8 + 2)
#define                                 IOCAP2_bit          _BIT_ACCESS(IOCAP,2)
// IOCAP<IOCAP3>
extern volatile __bit                   IOCAP3              __at(0x1D22B);	// @ (0x3A45 * 8 + 3)
#define                                 IOCAP3_bit          _BIT_ACCESS(IOCAP,3)
// IOCAP<IOCAP4>
extern volatile __bit                   IOCAP4              __at(0x1D22C);	// @ (0x3A45 * 8 + 4)
#define                                 IOCAP4_bit          _BIT_ACCESS(IOCAP,4)
// IOCAP<IOCAP5>
extern volatile __bit                   IOCAP5              __at(0x1D22D);	// @ (0x3A45 * 8 + 5)
#define                                 IOCAP5_bit          _BIT_ACCESS(IOCAP,5)
// IOCAP<IOCAP6>
extern volatile __bit                   IOCAP6              __at(0x1D22E);	// @ (0x3A45 * 8 + 6)
#define                                 IOCAP6_bit          _BIT_ACCESS(IOCAP,6)
// IOCAP<IOCAP7>
extern volatile __bit                   IOCAP7              __at(0x1D22F);	// @ (0x3A45 * 8 + 7)
#define                                 IOCAP7_bit          _BIT_ACCESS(IOCAP,7)
// IOCBF<IOCBF0>
extern volatile __bit                   IOCBF0              __at(0x1D2B8);	// @ (0x3A57 * 8 + 0)
#define                                 IOCBF0_bit          _BIT_ACCESS(IOCBF,0)
// IOCBF<IOCBF1>
extern volatile __bit                   IOCBF1              __at(0x1D2B9);	// @ (0x3A57 * 8 + 1)
#define                                 IOCBF1_bit          _BIT_ACCESS(IOCBF,1)
// IOCBF<IOCBF2>
extern volatile __bit                   IOCBF2              __at(0x1D2BA);	// @ (0x3A57 * 8 + 2)
#define                                 IOCBF2_bit          _BIT_ACCESS(IOCBF,2)
// IOCBF<IOCBF3>
extern volatile __bit                   IOCBF3              __at(0x1D2BB);	// @ (0x3A57 * 8 + 3)
#define                                 IOCBF3_bit          _BIT_ACCESS(IOCBF,3)
// IOCBF<IOCBF4>
extern volatile __bit                   IOCBF4              __at(0x1D2BC);	// @ (0x3A57 * 8 + 4)
#define                                 IOCBF4_bit          _BIT_ACCESS(IOCBF,4)
// IOCBF<IOCBF5>
extern volatile __bit                   IOCBF5              __at(0x1D2BD);	// @ (0x3A57 * 8 + 5)
#define                                 IOCBF5_bit          _BIT_ACCESS(IOCBF,5)
// IOCBF<IOCBF6>
extern volatile __bit                   IOCBF6              __at(0x1D2BE);	// @ (0x3A57 * 8 + 6)
#define                                 IOCBF6_bit          _BIT_ACCESS(IOCBF,6)
// IOCBF<IOCBF7>
extern volatile __bit                   IOCBF7              __at(0x1D2BF);	// @ (0x3A57 * 8 + 7)
#define                                 IOCBF7_bit          _BIT_ACCESS(IOCBF,7)
// IOCBN<IOCBN0>
extern volatile __bit                   IOCBN0              __at(0x1D2B0);	// @ (0x3A56 * 8 + 0)
#define                                 IOCBN0_bit          _BIT_ACCESS(IOCBN,0)
// IOCBN<IOCBN1>
extern volatile __bit                   IOCBN1              __at(0x1D2B1);	// @ (0x3A56 * 8 + 1)
#define                                 IOCBN1_bit          _BIT_ACCESS(IOCBN,1)
// IOCBN<IOCBN2>
extern volatile __bit                   IOCBN2              __at(0x1D2B2);	// @ (0x3A56 * 8 + 2)
#define                                 IOCBN2_bit          _BIT_ACCESS(IOCBN,2)
// IOCBN<IOCBN3>
extern volatile __bit                   IOCBN3              __at(0x1D2B3);	// @ (0x3A56 * 8 + 3)
#define                                 IOCBN3_bit          _BIT_ACCESS(IOCBN,3)
// IOCBN<IOCBN4>
extern volatile __bit                   IOCBN4              __at(0x1D2B4);	// @ (0x3A56 * 8 + 4)
#define                                 IOCBN4_bit          _BIT_ACCESS(IOCBN,4)
// IOCBN<IOCBN5>
extern volatile __bit                   IOCBN5              __at(0x1D2B5);	// @ (0x3A56 * 8 + 5)
#define                                 IOCBN5_bit          _BIT_ACCESS(IOCBN,5)
// IOCBN<IOCBN6>
extern volatile __bit                   IOCBN6              __at(0x1D2B6);	// @ (0x3A56 * 8 + 6)
#define                                 IOCBN6_bit          _BIT_ACCESS(IOCBN,6)
// IOCBN<IOCBN7>
extern volatile __bit                   IOCBN7              __at(0x1D2B7);	// @ (0x3A56 * 8 + 7)
#define                                 IOCBN7_bit          _BIT_ACCESS(IOCBN,7)
// IOCBP<IOCBP0>
extern volatile __bit                   IOCBP0              __at(0x1D2A8);	// @ (0x3A55 * 8 + 0)
#define                                 IOCBP0_bit          _BIT_ACCESS(IOCBP,0)
// IOCBP<IOCBP1>
extern volatile __bit                   IOCBP1              __at(0x1D2A9);	// @ (0x3A55 * 8 + 1)
#define                                 IOCBP1_bit          _BIT_ACCESS(IOCBP,1)
// IOCBP<IOCBP2>
extern volatile __bit                   IOCBP2              __at(0x1D2AA);	// @ (0x3A55 * 8 + 2)
#define                                 IOCBP2_bit          _BIT_ACCESS(IOCBP,2)
// IOCBP<IOCBP3>
