MikroElektronika/core_packages/PIC/XC8/def/PIC18F25K42/mcu.h
extern volatile __bit                   IOCBP3              __at(0x1D2AB);	// @ (0x3A55 * 8 + 3)
#define                                 IOCBP3_bit          _BIT_ACCESS(IOCBP,3)
// IOCBP<IOCBP4>
extern volatile __bit                   IOCBP4              __at(0x1D2AC);	// @ (0x3A55 * 8 + 4)
#define                                 IOCBP4_bit          _BIT_ACCESS(IOCBP,4)
// IOCBP<IOCBP5>
extern volatile __bit                   IOCBP5              __at(0x1D2AD);	// @ (0x3A55 * 8 + 5)
#define                                 IOCBP5_bit          _BIT_ACCESS(IOCBP,5)
// IOCBP<IOCBP6>
extern volatile __bit                   IOCBP6              __at(0x1D2AE);	// @ (0x3A55 * 8 + 6)
#define                                 IOCBP6_bit          _BIT_ACCESS(IOCBP,6)
// IOCBP<IOCBP7>
extern volatile __bit                   IOCBP7              __at(0x1D2AF);	// @ (0x3A55 * 8 + 7)
#define                                 IOCBP7_bit          _BIT_ACCESS(IOCBP,7)
// IOCCF<IOCCF0>
extern volatile __bit                   IOCCF0              __at(0x1D338);	// @ (0x3A67 * 8 + 0)
#define                                 IOCCF0_bit          _BIT_ACCESS(IOCCF,0)
// IOCCF<IOCCF1>
extern volatile __bit                   IOCCF1              __at(0x1D339);	// @ (0x3A67 * 8 + 1)
#define                                 IOCCF1_bit          _BIT_ACCESS(IOCCF,1)
// IOCCF<IOCCF2>
extern volatile __bit                   IOCCF2              __at(0x1D33A);	// @ (0x3A67 * 8 + 2)
#define                                 IOCCF2_bit          _BIT_ACCESS(IOCCF,2)
// IOCCF<IOCCF3>
extern volatile __bit                   IOCCF3              __at(0x1D33B);	// @ (0x3A67 * 8 + 3)
#define                                 IOCCF3_bit          _BIT_ACCESS(IOCCF,3)
// IOCCF<IOCCF4>
extern volatile __bit                   IOCCF4              __at(0x1D33C);	// @ (0x3A67 * 8 + 4)
#define                                 IOCCF4_bit          _BIT_ACCESS(IOCCF,4)
// IOCCF<IOCCF5>
extern volatile __bit                   IOCCF5              __at(0x1D33D);	// @ (0x3A67 * 8 + 5)
#define                                 IOCCF5_bit          _BIT_ACCESS(IOCCF,5)
// IOCCF<IOCCF6>
extern volatile __bit                   IOCCF6              __at(0x1D33E);	// @ (0x3A67 * 8 + 6)
#define                                 IOCCF6_bit          _BIT_ACCESS(IOCCF,6)
// IOCCF<IOCCF7>
extern volatile __bit                   IOCCF7              __at(0x1D33F);	// @ (0x3A67 * 8 + 7)
#define                                 IOCCF7_bit          _BIT_ACCESS(IOCCF,7)
// IOCCN<IOCCN0>
extern volatile __bit                   IOCCN0              __at(0x1D330);	// @ (0x3A66 * 8 + 0)
#define                                 IOCCN0_bit          _BIT_ACCESS(IOCCN,0)
// IOCCN<IOCCN1>
extern volatile __bit                   IOCCN1              __at(0x1D331);	// @ (0x3A66 * 8 + 1)
#define                                 IOCCN1_bit          _BIT_ACCESS(IOCCN,1)
// IOCCN<IOCCN2>
extern volatile __bit                   IOCCN2              __at(0x1D332);	// @ (0x3A66 * 8 + 2)
#define                                 IOCCN2_bit          _BIT_ACCESS(IOCCN,2)
// IOCCN<IOCCN3>
extern volatile __bit                   IOCCN3              __at(0x1D333);	// @ (0x3A66 * 8 + 3)
#define                                 IOCCN3_bit          _BIT_ACCESS(IOCCN,3)
// IOCCN<IOCCN4>
extern volatile __bit                   IOCCN4              __at(0x1D334);	// @ (0x3A66 * 8 + 4)
#define                                 IOCCN4_bit          _BIT_ACCESS(IOCCN,4)
// IOCCN<IOCCN5>
extern volatile __bit                   IOCCN5              __at(0x1D335);	// @ (0x3A66 * 8 + 5)
#define                                 IOCCN5_bit          _BIT_ACCESS(IOCCN,5)
// IOCCN<IOCCN6>
extern volatile __bit                   IOCCN6              __at(0x1D336);	// @ (0x3A66 * 8 + 6)
#define                                 IOCCN6_bit          _BIT_ACCESS(IOCCN,6)
// IOCCN<IOCCN7>
extern volatile __bit                   IOCCN7              __at(0x1D337);	// @ (0x3A66 * 8 + 7)
#define                                 IOCCN7_bit          _BIT_ACCESS(IOCCN,7)
// IOCCP<IOCCP0>
extern volatile __bit                   IOCCP0              __at(0x1D328);	// @ (0x3A65 * 8 + 0)
#define                                 IOCCP0_bit          _BIT_ACCESS(IOCCP,0)
// IOCCP<IOCCP1>
extern volatile __bit                   IOCCP1              __at(0x1D329);	// @ (0x3A65 * 8 + 1)
#define                                 IOCCP1_bit          _BIT_ACCESS(IOCCP,1)
// IOCCP<IOCCP2>
extern volatile __bit                   IOCCP2              __at(0x1D32A);	// @ (0x3A65 * 8 + 2)
#define                                 IOCCP2_bit          _BIT_ACCESS(IOCCP,2)
// IOCCP<IOCCP3>
extern volatile __bit                   IOCCP3              __at(0x1D32B);	// @ (0x3A65 * 8 + 3)
#define                                 IOCCP3_bit          _BIT_ACCESS(IOCCP,3)
// IOCCP<IOCCP4>
extern volatile __bit                   IOCCP4              __at(0x1D32C);	// @ (0x3A65 * 8 + 4)
#define                                 IOCCP4_bit          _BIT_ACCESS(IOCCP,4)
// IOCCP<IOCCP5>
extern volatile __bit                   IOCCP5              __at(0x1D32D);	// @ (0x3A65 * 8 + 5)
#define                                 IOCCP5_bit          _BIT_ACCESS(IOCCP,5)
// IOCCP<IOCCP6>
extern volatile __bit                   IOCCP6              __at(0x1D32E);	// @ (0x3A65 * 8 + 6)
#define                                 IOCCP6_bit          _BIT_ACCESS(IOCCP,6)
// IOCCP<IOCCP7>
extern volatile __bit                   IOCCP7              __at(0x1D32F);	// @ (0x3A65 * 8 + 7)
#define                                 IOCCP7_bit          _BIT_ACCESS(IOCCP,7)
// IOCEF<IOCEF3>
extern volatile __bit                   IOCEF3              __at(0x1D43B);	// @ (0x3A87 * 8 + 3)
#define                                 IOCEF3_bit          _BIT_ACCESS(IOCEF,3)
// IOCEN<IOCEN3>
extern volatile __bit                   IOCEN3              __at(0x1D433);	// @ (0x3A86 * 8 + 3)
#define                                 IOCEN3_bit          _BIT_ACCESS(IOCEN,3)
// IOCEP<IOCEP3>
extern volatile __bit                   IOCEP3              __at(0x1D42B);	// @ (0x3A85 * 8 + 3)
#define                                 IOCEP3_bit          _BIT_ACCESS(IOCEP,3)
// PIE0<IOCIE>
extern volatile __bit                   IOCIE               __at(0x1CC87);	// @ (0x3990 * 8 + 7)
#define                                 IOCIE_bit           _BIT_ACCESS(PIE0,7)
// PIR0<IOCIF>
extern volatile __bit                   IOCIF               __at(0x1CD07);	// @ (0x39A0 * 8 + 7)
#define                                 IOCIF_bit           _BIT_ACCESS(PIR0,7)
// IPR0<IOCIP>
extern volatile __bit                   IOCIP               __at(0x1CC07);	// @ (0x3980 * 8 + 7)
#define                                 IOCIP_bit           _BIT_ACCESS(IPR0,7)
// PMD0<IOCMD>
extern volatile __bit                   IOCMD               __at(0x1CE00);	// @ (0x39C0 * 8 + 0)
#define                                 IOCMD_bit           _BIT_ACCESS(PMD0,0)
// ISRPR<ISRPR0>
extern volatile __bit                   ISRPR0              __at(0x1CF88);	// @ (0x39F1 * 8 + 0)
#define                                 ISRPR0_bit          _BIT_ACCESS(ISRPR,0)
// ISRPR<ISRPR1>
extern volatile __bit                   ISRPR1              __at(0x1CF89);	// @ (0x39F1 * 8 + 1)
#define                                 ISRPR1_bit          _BIT_ACCESS(ISRPR,1)
// ISRPR<ISRPR2>
extern volatile __bit                   ISRPR2              __at(0x1CF8A);	// @ (0x39F1 * 8 + 2)
#define                                 ISRPR2_bit          _BIT_ACCESS(ISRPR,2)
// IVTLOCK<IVTLOCKED>
extern volatile __bit                   IVTLOCKED           __at(0x1FEA0);	// @ (0x3FD4 * 8 + 0)
#define                                 IVTLOCKED_bit       _BIT_ACCESS(IVTLOCK,0)
// LATA<LA0>
extern volatile __bit                   LA0                 __at(0x1FDD0);	// @ (0x3FBA * 8 + 0)
#define                                 LA0_bit             _BIT_ACCESS(LATA,0)
// LATA<LA1>
extern volatile __bit                   LA1                 __at(0x1FDD1);	// @ (0x3FBA * 8 + 1)
#define                                 LA1_bit             _BIT_ACCESS(LATA,1)
// LATA<LA2>
extern volatile __bit                   LA2                 __at(0x1FDD2);	// @ (0x3FBA * 8 + 2)
#define                                 LA2_bit             _BIT_ACCESS(LATA,2)
// LATA<LA3>
extern volatile __bit                   LA3                 __at(0x1FDD3);	// @ (0x3FBA * 8 + 3)
#define                                 LA3_bit             _BIT_ACCESS(LATA,3)
// LATA<LA4>
extern volatile __bit                   LA4                 __at(0x1FDD4);	// @ (0x3FBA * 8 + 4)
#define                                 LA4_bit             _BIT_ACCESS(LATA,4)
// LATA<LA5>
extern volatile __bit                   LA5                 __at(0x1FDD5);	// @ (0x3FBA * 8 + 5)
#define                                 LA5_bit             _BIT_ACCESS(LATA,5)
// LATA<LA6>
extern volatile __bit                   LA6                 __at(0x1FDD6);	// @ (0x3FBA * 8 + 6)
#define                                 LA6_bit             _BIT_ACCESS(LATA,6)
// LATA<LA7>
extern volatile __bit                   LA7                 __at(0x1FDD7);	// @ (0x3FBA * 8 + 7)
#define                                 LA7_bit             _BIT_ACCESS(LATA,7)
// SCANLADRL<LADR0>
extern volatile __bit                   LADR0               __at(0x1CBB0);	// @ (0x3976 * 8 + 0)
#define                                 LADR0_bit           _BIT_ACCESS(SCANLADRL,0)
// SCANLADRL<LADR1>
extern volatile __bit                   LADR1               __at(0x1CBB1);	// @ (0x3976 * 8 + 1)
#define                                 LADR1_bit           _BIT_ACCESS(SCANLADRL,1)
// SCANLADRH<LADR10>
extern volatile __bit                   LADR10              __at(0x1CBBA);	// @ (0x3977 * 8 + 2)
#define                                 LADR10_bit          _BIT_ACCESS(SCANLADRH,2)
// SCANLADRH<LADR11>
extern volatile __bit                   LADR11              __at(0x1CBBB);	// @ (0x3977 * 8 + 3)
#define                                 LADR11_bit          _BIT_ACCESS(SCANLADRH,3)
// SCANLADRH<LADR12>
extern volatile __bit                   LADR12              __at(0x1CBBC);	// @ (0x3977 * 8 + 4)
#define                                 LADR12_bit          _BIT_ACCESS(SCANLADRH,4)
// SCANLADRH<LADR13>
extern volatile __bit                   LADR13              __at(0x1CBBD);	// @ (0x3977 * 8 + 5)
#define                                 LADR13_bit          _BIT_ACCESS(SCANLADRH,5)
// SCANLADRH<LADR14>
extern volatile __bit                   LADR14              __at(0x1CBBE);	// @ (0x3977 * 8 + 6)
#define                                 LADR14_bit          _BIT_ACCESS(SCANLADRH,6)
// SCANLADRH<LADR15>
extern volatile __bit                   LADR15              __at(0x1CBBF);	// @ (0x3977 * 8 + 7)
#define                                 LADR15_bit          _BIT_ACCESS(SCANLADRH,7)
// SCANLADRU<LADR16>
extern volatile __bit                   LADR16              __at(0x1CBC0);	// @ (0x3978 * 8 + 0)
#define                                 LADR16_bit          _BIT_ACCESS(SCANLADRU,0)
// SCANLADRU<LADR17>
extern volatile __bit                   LADR17              __at(0x1CBC1);	// @ (0x3978 * 8 + 1)
#define                                 LADR17_bit          _BIT_ACCESS(SCANLADRU,1)
// SCANLADRU<LADR18>
extern volatile __bit                   LADR18              __at(0x1CBC2);	// @ (0x3978 * 8 + 2)
#define                                 LADR18_bit          _BIT_ACCESS(SCANLADRU,2)
// SCANLADRU<LADR19>
extern volatile __bit                   LADR19              __at(0x1CBC3);	// @ (0x3978 * 8 + 3)
#define                                 LADR19_bit          _BIT_ACCESS(SCANLADRU,3)
// SCANLADRL<LADR2>
extern volatile __bit                   LADR2               __at(0x1CBB2);	// @ (0x3976 * 8 + 2)
#define                                 LADR2_bit           _BIT_ACCESS(SCANLADRL,2)
// SCANLADRU<LADR20>
extern volatile __bit                   LADR20              __at(0x1CBC4);	// @ (0x3978 * 8 + 4)
#define                                 LADR20_bit          _BIT_ACCESS(SCANLADRU,4)
// SCANLADRU<LADR21>
extern volatile __bit                   LADR21              __at(0x1CBC5);	// @ (0x3978 * 8 + 5)
#define                                 LADR21_bit          _BIT_ACCESS(SCANLADRU,5)
// SCANLADRL<LADR3>
extern volatile __bit                   LADR3               __at(0x1CBB3);	// @ (0x3976 * 8 + 3)
#define                                 LADR3_bit           _BIT_ACCESS(SCANLADRL,3)
// SCANLADRL<LADR4>
extern volatile __bit                   LADR4               __at(0x1CBB4);	// @ (0x3976 * 8 + 4)
#define                                 LADR4_bit           _BIT_ACCESS(SCANLADRL,4)
// SCANLADRL<LADR5>
extern volatile __bit                   LADR5               __at(0x1CBB5);	// @ (0x3976 * 8 + 5)
#define                                 LADR5_bit           _BIT_ACCESS(SCANLADRL,5)
// SCANLADRL<LADR6>
extern volatile __bit                   LADR6               __at(0x1CBB6);	// @ (0x3976 * 8 + 6)
#define                                 LADR6_bit           _BIT_ACCESS(SCANLADRL,6)
// SCANLADRL<LADR7>
extern volatile __bit                   LADR7               __at(0x1CBB7);	// @ (0x3976 * 8 + 7)
#define                                 LADR7_bit           _BIT_ACCESS(SCANLADRL,7)
// SCANLADRH<LADR8>
extern volatile __bit                   LADR8               __at(0x1CBB8);	// @ (0x3977 * 8 + 0)
#define                                 LADR8_bit           _BIT_ACCESS(SCANLADRH,0)
// SCANLADRH<LADR9>
extern volatile __bit                   LADR9               __at(0x1CBB9);	// @ (0x3977 * 8 + 1)
#define                                 LADR9_bit           _BIT_ACCESS(SCANLADRH,1)
// LATA<LATA0>
extern volatile __bit                   LATA0               __at(0x1FDD0);	// @ (0x3FBA * 8 + 0)
#define                                 LATA0_bit           _BIT_ACCESS(LATA,0)
// LATA<LATA1>
extern volatile __bit                   LATA1               __at(0x1FDD1);	// @ (0x3FBA * 8 + 1)
#define                                 LATA1_bit           _BIT_ACCESS(LATA,1)
// LATA<LATA2>
extern volatile __bit                   LATA2               __at(0x1FDD2);	// @ (0x3FBA * 8 + 2)
#define                                 LATA2_bit           _BIT_ACCESS(LATA,2)
// LATA<LATA3>
extern volatile __bit                   LATA3               __at(0x1FDD3);	// @ (0x3FBA * 8 + 3)
#define                                 LATA3_bit           _BIT_ACCESS(LATA,3)
// LATA<LATA4>
extern volatile __bit                   LATA4               __at(0x1FDD4);	// @ (0x3FBA * 8 + 4)
#define                                 LATA4_bit           _BIT_ACCESS(LATA,4)
// LATA<LATA5>
extern volatile __bit                   LATA5               __at(0x1FDD5);	// @ (0x3FBA * 8 + 5)
#define                                 LATA5_bit           _BIT_ACCESS(LATA,5)
// LATA<LATA6>
extern volatile __bit                   LATA6               __at(0x1FDD6);	// @ (0x3FBA * 8 + 6)
#define                                 LATA6_bit           _BIT_ACCESS(LATA,6)
// LATA<LATA7>
extern volatile __bit                   LATA7               __at(0x1FDD7);	// @ (0x3FBA * 8 + 7)
#define                                 LATA7_bit           _BIT_ACCESS(LATA,7)
// LATB<LATB0>
extern volatile __bit                   LATB0               __at(0x1FDD8);	// @ (0x3FBB * 8 + 0)
#define                                 LATB0_bit           _BIT_ACCESS(LATB,0)
// LATB<LATB1>
extern volatile __bit                   LATB1               __at(0x1FDD9);	// @ (0x3FBB * 8 + 1)
#define                                 LATB1_bit           _BIT_ACCESS(LATB,1)
// LATB<LATB2>
extern volatile __bit                   LATB2               __at(0x1FDDA);	// @ (0x3FBB * 8 + 2)
#define                                 LATB2_bit           _BIT_ACCESS(LATB,2)
// LATB<LATB3>
extern volatile __bit                   LATB3               __at(0x1FDDB);	// @ (0x3FBB * 8 + 3)
#define                                 LATB3_bit           _BIT_ACCESS(LATB,3)
// LATB<LATB4>
extern volatile __bit                   LATB4               __at(0x1FDDC);	// @ (0x3FBB * 8 + 4)
#define                                 LATB4_bit           _BIT_ACCESS(LATB,4)
// LATB<LATB5>
extern volatile __bit                   LATB5               __at(0x1FDDD);	// @ (0x3FBB * 8 + 5)
#define                                 LATB5_bit           _BIT_ACCESS(LATB,5)
// LATB<LATB6>
extern volatile __bit                   LATB6               __at(0x1FDDE);	// @ (0x3FBB * 8 + 6)
#define                                 LATB6_bit           _BIT_ACCESS(LATB,6)
// LATB<LATB7>
extern volatile __bit                   LATB7               __at(0x1FDDF);	// @ (0x3FBB * 8 + 7)
#define                                 LATB7_bit           _BIT_ACCESS(LATB,7)
// LATC<LATC0>
extern volatile __bit                   LATC0               __at(0x1FDE0);	// @ (0x3FBC * 8 + 0)
#define                                 LATC0_bit           _BIT_ACCESS(LATC,0)
// LATC<LATC1>
extern volatile __bit                   LATC1               __at(0x1FDE1);	// @ (0x3FBC * 8 + 1)
#define                                 LATC1_bit           _BIT_ACCESS(LATC,1)
// LATC<LATC2>
extern volatile __bit                   LATC2               __at(0x1FDE2);	// @ (0x3FBC * 8 + 2)
#define                                 LATC2_bit           _BIT_ACCESS(LATC,2)
// LATC<LATC3>
extern volatile __bit                   LATC3               __at(0x1FDE3);	// @ (0x3FBC * 8 + 3)
#define                                 LATC3_bit           _BIT_ACCESS(LATC,3)
// LATC<LATC4>
extern volatile __bit                   LATC4               __at(0x1FDE4);	// @ (0x3FBC * 8 + 4)
#define                                 LATC4_bit           _BIT_ACCESS(LATC,4)
// LATC<LATC5>
extern volatile __bit                   LATC5               __at(0x1FDE5);	// @ (0x3FBC * 8 + 5)
#define                                 LATC5_bit           _BIT_ACCESS(LATC,5)
// LATC<LATC6>
extern volatile __bit                   LATC6               __at(0x1FDE6);	// @ (0x3FBC * 8 + 6)
#define                                 LATC6_bit           _BIT_ACCESS(LATC,6)
// LATC<LATC7>
extern volatile __bit                   LATC7               __at(0x1FDE7);	// @ (0x3FBC * 8 + 7)
#define                                 LATC7_bit           _BIT_ACCESS(LATC,7)
// LATB<LB0>
extern volatile __bit                   LB0                 __at(0x1FDD8);	// @ (0x3FBB * 8 + 0)
#define                                 LB0_bit             _BIT_ACCESS(LATB,0)
// LATB<LB1>
extern volatile __bit                   LB1                 __at(0x1FDD9);	// @ (0x3FBB * 8 + 1)
#define                                 LB1_bit             _BIT_ACCESS(LATB,1)
// LATB<LB2>
extern volatile __bit                   LB2                 __at(0x1FDDA);	// @ (0x3FBB * 8 + 2)
#define                                 LB2_bit             _BIT_ACCESS(LATB,2)
// LATB<LB3>
extern volatile __bit                   LB3                 __at(0x1FDDB);	// @ (0x3FBB * 8 + 3)
#define                                 LB3_bit             _BIT_ACCESS(LATB,3)
// LATB<LB4>
extern volatile __bit                   LB4                 __at(0x1FDDC);	// @ (0x3FBB * 8 + 4)
#define                                 LB4_bit             _BIT_ACCESS(LATB,4)
// LATB<LB5>
extern volatile __bit                   LB5                 __at(0x1FDDD);	// @ (0x3FBB * 8 + 5)
#define                                 LB5_bit             _BIT_ACCESS(LATB,5)
// LATB<LB6>
extern volatile __bit                   LB6                 __at(0x1FDDE);	// @ (0x3FBB * 8 + 6)
#define                                 LB6_bit             _BIT_ACCESS(LATB,6)
// LATB<LB7>
extern volatile __bit                   LB7                 __at(0x1FDDF);	// @ (0x3FBB * 8 + 7)
#define                                 LB7_bit             _BIT_ACCESS(LATB,7)
// LATC<LC0>
extern volatile __bit                   LC0                 __at(0x1FDE0);	// @ (0x3FBC * 8 + 0)
#define                                 LC0_bit             _BIT_ACCESS(LATC,0)
// LATC<LC1>
extern volatile __bit                   LC1                 __at(0x1FDE1);	// @ (0x3FBC * 8 + 1)
#define                                 LC1_bit             _BIT_ACCESS(LATC,1)
// CLC1SEL0<LC1D1S0>
extern volatile __bit                   LC1D1S0             __at(0x1E3B0);	// @ (0x3C76 * 8 + 0)
#define                                 LC1D1S0_bit         _BIT_ACCESS(CLC1SEL0,0)
// CLC1SEL0<LC1D1S1>
extern volatile __bit                   LC1D1S1             __at(0x1E3B1);	// @ (0x3C76 * 8 + 1)
#define                                 LC1D1S1_bit         _BIT_ACCESS(CLC1SEL0,1)
// CLC1SEL0<LC1D1S2>
extern volatile __bit                   LC1D1S2             __at(0x1E3B2);	// @ (0x3C76 * 8 + 2)
#define                                 LC1D1S2_bit         _BIT_ACCESS(CLC1SEL0,2)
// CLC1SEL0<LC1D1S3>
extern volatile __bit                   LC1D1S3             __at(0x1E3B3);	// @ (0x3C76 * 8 + 3)
#define                                 LC1D1S3_bit         _BIT_ACCESS(CLC1SEL0,3)
// CLC1SEL0<LC1D1S4>
extern volatile __bit                   LC1D1S4             __at(0x1E3B4);	// @ (0x3C76 * 8 + 4)
#define                                 LC1D1S4_bit         _BIT_ACCESS(CLC1SEL0,4)
// CLC1SEL0<LC1D1S5>
extern volatile __bit                   LC1D1S5             __at(0x1E3B5);	// @ (0x3C76 * 8 + 5)
#define                                 LC1D1S5_bit         _BIT_ACCESS(CLC1SEL0,5)
// CLC1SEL0<LC1D1S6>
extern volatile __bit                   LC1D1S6             __at(0x1E3B6);	// @ (0x3C76 * 8 + 6)
#define                                 LC1D1S6_bit         _BIT_ACCESS(CLC1SEL0,6)
// CLC1SEL0<LC1D1S7>
extern volatile __bit                   LC1D1S7             __at(0x1E3B7);	// @ (0x3C76 * 8 + 7)
#define                                 LC1D1S7_bit         _BIT_ACCESS(CLC1SEL0,7)
// CLC1SEL1<LC1D2S0>
extern volatile __bit                   LC1D2S0             __at(0x1E3B8);	// @ (0x3C77 * 8 + 0)
#define                                 LC1D2S0_bit         _BIT_ACCESS(CLC1SEL1,0)
// CLC1SEL1<LC1D2S1>
extern volatile __bit                   LC1D2S1             __at(0x1E3B9);	// @ (0x3C77 * 8 + 1)
#define                                 LC1D2S1_bit         _BIT_ACCESS(CLC1SEL1,1)
// CLC1SEL1<LC1D2S2>
extern volatile __bit                   LC1D2S2             __at(0x1E3BA);	// @ (0x3C77 * 8 + 2)
#define                                 LC1D2S2_bit         _BIT_ACCESS(CLC1SEL1,2)
// CLC1SEL1<LC1D2S3>
extern volatile __bit                   LC1D2S3             __at(0x1E3BB);	// @ (0x3C77 * 8 + 3)
#define                                 LC1D2S3_bit         _BIT_ACCESS(CLC1SEL1,3)
// CLC1SEL1<LC1D2S4>
extern volatile __bit                   LC1D2S4             __at(0x1E3BC);	// @ (0x3C77 * 8 + 4)
#define                                 LC1D2S4_bit         _BIT_ACCESS(CLC1SEL1,4)
// CLC1SEL1<LC1D2S5>
extern volatile __bit                   LC1D2S5             __at(0x1E3BD);	// @ (0x3C77 * 8 + 5)
#define                                 LC1D2S5_bit         _BIT_ACCESS(CLC1SEL1,5)
// CLC1SEL1<LC1D2S6>
extern volatile __bit                   LC1D2S6             __at(0x1E3BE);	// @ (0x3C77 * 8 + 6)
#define                                 LC1D2S6_bit         _BIT_ACCESS(CLC1SEL1,6)
// CLC1SEL1<LC1D2S7>
extern volatile __bit                   LC1D2S7             __at(0x1E3BF);	// @ (0x3C77 * 8 + 7)
#define                                 LC1D2S7_bit         _BIT_ACCESS(CLC1SEL1,7)
// CLC1SEL2<LC1D3S0>
extern volatile __bit                   LC1D3S0             __at(0x1E3C0);	// @ (0x3C78 * 8 + 0)
#define                                 LC1D3S0_bit         _BIT_ACCESS(CLC1SEL2,0)
// CLC1SEL2<LC1D3S1>
extern volatile __bit                   LC1D3S1             __at(0x1E3C1);	// @ (0x3C78 * 8 + 1)
#define                                 LC1D3S1_bit         _BIT_ACCESS(CLC1SEL2,1)
// CLC1SEL2<LC1D3S2>
